import numpy as np

# 矩阵A是一组比赛数据,每一行表示每个系的系别,每一列依次为比赛名次1-5
A = [[1, 0, 0, 1, 0],
     [0, 1, 0, 0, 0],
     [0, 0, 2, 0, 0],
     [1, 0, 0, 0, 1],
     [0, 1, 0, 1, 0],
     [0, 0, 0, 0, 1]]

# B矩阵每一行依次为排名,每一列依次为分值和奖金,
B = [[7, 100],
     [5, 70],
     [3, 50],
     [2, 20],
     [1, 10]]

# 点乘A,B两个举证得到每个系共获得的总分值和奖金总数
print(np.dot(A, B))
# [[  9 120]
#  [  5  70]
#  [  6 100]
#  [  8 110]
#  [  7  90]
#  [  1  10]]

# --------------------------------------------
# 测试__all__声明
from example.__all__是什么 import *
from example.__all__是什么 import f2
f1()
# 因为f2()没有在__all__中声明,无法通过import *导入并在外部调用
# f2()
f2()
